In [1]:
import pandas as pd
pd.set_option('display.max_columns', None)
pd.set_option('display.max_rows', None)
import re
import sys
sys.path.append('../src')

from support_cleaning import *

Importing all necessary modules and libraries including the ones I created in support_cleaning.py
Changing the display settings for rows and columns in pandas to improve visibility.

In [2]:
moon_phases_ori= pd.read_csv('../data/original/moon_phases.csv')
moon_phases=moon_phases_ori.copy()

Opening the moon_phases file and creating a copy

In [3]:
moon_phases = moon_phases.rename(columns={'0': 'year'})
moon_phases.head()

   year                                                  1
0  1994                                    Date Moon Phase
1  1994                       Sat Jan 1 Waning Gibbous Leo
2  1994  Sun Jan 2 Waning Gibbous Virgo Pancreas, small...
3  1994                     Mon Jan 3 Waning Gibbous Virgo
4  1994                             Tue Jan 4 Last Quarter

Renaming column with years as 'year'

In [4]:
moon_phases['month']=moon_phases['1']

In [5]:
moon_phases['day']=moon_phases['1']

In [6]:
moon_phases['phase']=moon_phases['1']

I want to create a column for month, a column for day and a column for phase so for now i am creating them with the values in column 1 since I will need to use those to calculate the values for my new columns.

In [7]:
moon_phases.head()

,year,1,month,day,phase
0,1994,Date Moon Phase,Date Moon Phase,Date Moon Phase,Date Moon Phase
1,1994,Sat Jan 1 Waning Gibbous Leo,Sat Jan 1 Waning Gibbous Leo,Sat Jan 1 Waning Gibbous Leo,Sat Jan 1 Waning Gibbous Leo
2,1994,"Sun Jan 2 Waning Gibbous Virgo Pancreas, small...","Sun Jan 2 Waning Gibbous Virgo Pancreas, small...","Sun Jan 2 Waning Gibbous Virgo Pancreas, small...","Sun Jan 2 Waning Gibbous Virgo Pancreas, small..."
3,1994,Mon Jan 3 Waning Gibbous Virgo,Mon Jan 3 Waning Gibbous Virgo,Mon Jan 3 Waning Gibbous Virgo,Mon Jan 3 Waning Gibbous Virgo
4,1994,Tue Jan 4 Last Quarter,Tue Jan 4 Last Quarter,Tue Jan 4 Last Quarter,Tue Jan 4 Last Quarter

In [8]:
moon_phases['month'] = moon_phases['month'].apply(cleaning_month_phases)

In [9]:
moon_phases['day'] = moon_phases['day'].apply(cleaning_day)

In [10]:
moon_phases['phase'] = moon_phases['phase'].apply(cleaning_phase)

I created functions cleaning_month_phases, cleaning_day and cleaning_phase (you can find them in src/support_cleaning.py  
I am calling them here to calculate the month for column 'month', the day for column 'day' and the moon phase for column 'phase'

In [11]:
moon_phases = moon_phases.drop('1', axis=1)

Dropping column '1' since all the info in it is already in my df.

In [12]:
moon_phases.head()

   year            month              day            phase
0  1994  Date Moon Phase  Date Moon Phase  Date Moon Phase
1  1994                1                1   waning gibbous
2  1994                1                2   waning gibbous
3  1994                1                3   waning gibbous
4  1994                1                4     last quarter

In [13]:
to_drop=moon_phases['month'][moon_phases['month']=='Date Moon Phase'].index

In [14]:
to_drop

Int64Index([   0,   32,   61,   93,  124,  156,  187,  219,  251,  282,
            ...
            3456, 3488, 3519, 3551, 3582, 3614, 3646, 3677, 3709, 3740],
           dtype='int64', length=120)

In [15]:
moon_phases=moon_phases.drop(to_drop)

Dropping all the rows with value 'Date Moon Phase' since that was the header of the table from the page the data was taken from.

In [16]:
moon_phases.phase.unique()

array(['waning gibbous', 'last quarter', 'waning crescent', 'new moon',
       'waxing crescent', 'first quarter', 'waxing gibbous', 'full moon'],
      dtype=object)

In [17]:
moon_phases.duplicated().any()

False

No duplicates

In [18]:
moon_phases.to_csv("../data/clean/moon_phases_clean.csv", index=False)

Saving file.

In [19]:
eclipses_ori= pd.read_csv('../data/original/eclipses.csv')
eclipses=eclipses_ori.copy()
eclipses.head()

,0,1,2,3,4,5,6
0,Date and time of Greatest Eclipse Eclipse Moon...,Serie Duration Chart,Impact,Chart,NaN,NaN,NaN
1,"Tue May 10, 1994",at 17:12 Annular,Solar Eclipse,Taurus,19°51’ 128 06m13s eclipse,chart impact,chart
2,"Wed May 25, 1994",at 03:31 Partial,Lunar Eclipse,Sagittarius,3°37’ 140 eclipse,chart impact,chart
3,"Thu Nov 3, 1994",at 13:40 Total,Solar Eclipse,Scorpio,10°57’ 133 04m23s eclipse,chart impact,chart
4,"Fri Nov 18, 1994",at 06:44 Penumbral,Lunar Eclipse,Taurus,25°35’ 145 eclipse,chart impact,chart

Opening the file for eclipses

In [20]:
eclipses=eclipses[['0','2']]

Keeping only the columns I am interested in.

In [21]:
eclipses=eclipses.rename(columns={'0':'fulldate','2':'eclipse'})

Renaming the columns

In [22]:
to_drop=eclipses['eclipse'][eclipses['eclipse']=='Impact'].index

In [23]:
eclipses=eclipses.drop(to_drop)

In [24]:
eclipses.head()

           fulldate        eclipse
1  Tue May 10, 1994  Solar Eclipse
2  Wed May 25, 1994  Lunar Eclipse
3   Thu Nov 3, 1994  Solar Eclipse
4  Fri Nov 18, 1994  Lunar Eclipse
5  Sat Apr 15, 1995  Lunar Eclipse

Dropping the rows where the value is 'Impact'

In [25]:
eclipses['year']=eclipses['fulldate']
eclipses['month']=eclipses['fulldate']
eclipses['day']=eclipses['fulldate']

In [26]:
eclipses['year'] = eclipses['year'].apply(cleaning_year_ecl)

In [27]:
eclipses['month'] = eclipses['month'].apply(cleaning_month_phases)

In [28]:
eclipses['day'] = eclipses['day'].apply(cleaning_day_ecl)

Creating columns for year month and day and then calling the functions I created to clean them.

In [29]:
eclipses=eclipses.drop('fulldate', axis=1)

In [30]:
eclipses = eclipses[(eclipses['year'] >= 1994) & (eclipses['year'] <= 2003)]

Dropping column 'fulldate' since it is no longer necessary. Also only keeping rows where years are between 1994 and 2003, since those are the years in my other data

In [31]:
eclipses.head()

         eclipse  year  month  day
1  Solar Eclipse  1994      5   10
2  Lunar Eclipse  1994      5   25
3  Solar Eclipse  1994     11    3
4  Lunar Eclipse  1994     11   18
5  Lunar Eclipse  1995      4   15

In [32]:
eclipses.to_csv("../data/clean/eclipses_clean.csv", index=False)

Saving the file

In [33]:
holidays = pd.DataFrame()

years = range(1994, 2004)

for year in years:
    file_path = f'../data/original/public_holidays/publicholiday.US.{year}.csv' 
    
    holidays_data = pd.read_csv(file_path)
    
    holidays = holidays.append(holidays_data, ignore_index=True)

In [34]:
holidays.head()

,Date,LocalName,Name,CountryCode,Fixed,Global,LaunchYear,Type,Counties
0,1993-12-31,New Year's Day,New Year's Day,US,False,True,NaN,Public,NaN
1,1994-01-17,"Martin Luther King, Jr. Day","Martin Luther King, Jr. Day",US,False,True,NaN,Public,NaN
2,1994-02-21,Presidents Day,Washington's Birthday,US,False,True,NaN,Public,NaN
3,1994-04-01,Good Friday,Good Friday,US,False,False,NaN,Public,"US-CT,US-DE,US-HI,US-IN,US-KY,US-LA,US-NC,US-N..."
4,1994-04-01,Good Friday,Good Friday,US,False,False,NaN,Optional,US-TX

Combining all the files for public holidays (there is one .csv file for each year) and opening them as a dataframe.

In [35]:
holidays=holidays[['Date','Name']]

Choosing only the columns I am interested in

In [36]:
holidays['year']=holidays['Date']
holidays['month']=holidays['Date']
holidays['day']=holidays['Date']

Creating columns for year month and day.

In [37]:
holidays['year'] = holidays['year'].apply(cleaning_hol_year)
holidays['month'] = holidays['month'].apply(cleaning_hol_month)
holidays['day'] = holidays['day'].apply(cleaning_hol_day)

Cleaning my newly-created columns with the functions I created in support_cleaning.py

In [38]:
holidays=holidays.drop('Date', axis=1)

In [39]:
holidays=holidays.rename(columns={'Name':'holiday'})

Dropping column 'Date' since it is no longer necessary and changing column 'Name' to 'holiday'.

In [40]:
holidays['year'] = holidays['year'].astype(int)
holidays['month'] = holidays['month'].astype(int)
holidays['day'] = holidays['day'].astype(int)

Changing the type of 'year', 'month' and 'day' so they appear as integers (1 instead of 01 etc.)

In [41]:
holidays=holidays[1:]

Choosing from index 1 forward since index 0 is a holiday from 1993.

In [42]:
holidays.head()

                       holiday  year  month  day
1  Martin Luther King, Jr. Day  1994      1   17
2        Washington's Birthday  1994      2   21
3                  Good Friday  1994      4    1
4                  Good Friday  1994      4    1
5                 Memorial Day  1994      5   30

In [43]:
holidays.to_csv('../data/clean/holidays_clean.csv', index=False)

Saving the file

In [44]:
births_ori= pd.read_csv('../data/original/US_births_1994-2003_CDC_NCHS.csv')
births=births_ori.copy()
births.head()

   year  month  date_of_month  day_of_week  births
0  1994      1              1            6    8096
1  1994      1              2            7    7772
2  1994      1              3            1   10142
3  1994      1              4            2   11248
4  1994      1              5            3   11053

Opening the births file.

In [45]:
births=births.rename(columns={'date_of_month': 'day', 'day_of_week':'dow'})

Renaming the columns to make sure the names are consistent accross all files

In [46]:
births['dow']=births['dow'].apply(cleaning_dow)

Changing column 'dow' to calculate the name of each day of the week using a function I made in support_cleaning.py

In [47]:
births.head()

   year  month  day        dow  births
0  1994      1    1   Saturday    8096
1  1994      1    2     Sunday    7772
2  1994      1    3     Monday   10142
3  1994      1    4    Tuesday   11248
4  1994      1    5  Wednesday   11053

In [48]:
births.to_csv('../data/clean/births_clean.csv', index=False)

Saving the file

In [49]:
final = births.merge(moon_phases, on=['year', 'month', 'day'], how='outer') \
                    .merge(eclipses, on=['year', 'month', 'day'], how='outer') \
                    .merge(holidays, on=['year', 'month', 'day'], how='outer')

Merged all the dataframes together. Dataframe births and moon_phases had the same amount of rows. However, dataframe eclipse and holidays had less rows. Only the days where there was an eclipse in the case of eclipses df and only the days where there was a public holiday in the case of holidays.

In [50]:
for index, row in final.iterrows():
    if pd.isna(row['eclipse']):
        final.loc[index, 'eclipse']= final.loc[index, 'phase']

Filled in the column eclipse with the value in column phase only for the nulls in column eclipse. That way I can have all the information in one column.

In [51]:
final=final.drop('phase', axis=1)

Dropped column 'phase' since all the info is now in column 'eclipse'

In [52]:
final=final.rename(columns={'eclipse':'moon_phase'})

Changed the name of column 'eclipse' to 'moon_phase'

In [53]:
final['holiday'].fillna('Not a holiday', inplace=True)

Filled in the null values in column 'holiday' with 'Not a holiday'

In [54]:
final.head()

   year month day        dow  births      moon_phase        holiday
0  1994     1   1   Saturday    8096  waning gibbous  Not a holiday
1  1994     1   2     Sunday    7772  waning gibbous  Not a holiday
2  1994     1   3     Monday   10142  waning gibbous  Not a holiday
3  1994     1   4    Tuesday   11248    last quarter  Not a holiday
4  1994     1   5  Wednesday   11053    last quarter  Not a holiday

In [55]:
final.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3662 entries, 0 to 3661
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   year        3662 non-null   int64
 1   month       3662 non-null   object
 2   day         3662 non-null   object
 3   dow         3662 non-null   object
 4   births      3662 non-null   int64
 5   moon_phase  3662 non-null   object
 6   holiday     3662 non-null   object
dtypes: int64(2), object(5)
memory usage: 357.9+ KB

In [56]:
final['month']=final['month'].astype('int')
final['day']=final['day'].astype('int')

In [57]:
convert_object_to_category(final)

In [58]:
downcast_int(final)

In [59]:
final.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3662 entries, 0 to 3661
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   year        3662 non-null   int16
 1   month       3662 non-null   int8
 2   day         3662 non-null   int8
 3   dow         3662 non-null   category
 4   births      3662 non-null   int16
 5   moon_phase  3662 non-null   category
 6   holiday     3662 non-null   category
dtypes: category(3), int16(2), int8(2)
memory usage: 190.9 KB

Changed 'month' and 'day' to integers. Changed 'dow', 'moon_phase' and 'holiday' to category type and downcasted all integers.

In [62]:
final.to_csv('../data/clean/final_clean.csv', index=False)

Saved file